{
  "system_quality_attributes": {
    "operational": {
      "availability": "The proportion of time the system is functional and accessible (often measured in 'nines').",
      "reliability": "The ability of the system to perform its intended functions under stated conditions for a specified period.",
      "performance_efficiency": "The system's responsiveness and throughput relative to the resources consumed (CPU, memory, bandwidth).",
      "scalability": "The ability to handle increasing workloads by adding resources (Vertical/Scale-up or Horizontal/Scale-out).",
      "security": "The degree to which the system protects information and data from unauthorized access or modification.",
      "robustness": "The ability of a system to maintain its function even when faced with invalid inputs or stressful environmental conditions.",
      "resilience": "The ability of a system to recover quickly from failures or 'bounce back' after a disruption.",
      "observability": "The degree to which the internal state of the system can be inferred from its external outputs (logs, metrics, traces)."
    },
    "structural": {
      "maintainability": "The ease with which a system can be modified to correct defects, improve performance, or adapt to a changed environment.",
      "testability": "The degree to which the system supports testing to verify its requirements and logic.",
      "modularity": "The extent to which a system's components may be separated and recombined.",
      "extensibility": "The ability to add new functionality to a system without changing its existing architecture.",
      "reusability": "The degree to which assets (code, components) can be used in more than one software system.",
      "readability": "The ease with which a human developer can understand the source code and logic flow."
    },
    "environmental": {
      "portability": "The ease with which a system can be transferred from one hardware or software environment to another.",
      "interoperability": "The ability of two or more systems or components to exchange and use information.",
      "deployability": "The ease and speed with which a system can be moved from a development state into production.",
      "compliance": "The degree to which the system adheres to laws, regulations, and industry standards."
    },
    "user_centric": {
      "usability": "The ease of use and learnability of the system for its intended users.",
      "accessibility": "The degree to which a system is usable by people with the widest range of capabilities."
    }
  }
}
